import React from 'react';
import { Container, Row, Col, Image } from 'react-bootstrap';

import Clients from '../../assets/clients.jpeg';
import Interier from '../../assets/interier.jpeg';
import Personal from '../../assets/personal.jpeg';
import Pizza from '../../assets/pizza.jpeg';

const aboutUsData = [
  {
    title: `Меню Mamasita Pizza доволі різноманітне, ми постійно 
    доповнюємо та вдосконалюємо його, залежно від смаків та вподобань наших гостей. 
    Та найголовніше, без чого ми не можемо існувати, що змушує наші серця битися 
    частіше, – звичайно ж, Піца! Ті, хто куштував нашу піцу, кажуть, що вона одна 
    з найкращих у місті. У нас понад  10 найменувань піци, абсолютно на будь-який смак.`,
    image: Pizza
  },
  {
    title: `Ми подаруємо Вам задоволення від смаку наших страв 
    та чудовий бадьорий настрій. Персонал піцеріі завжди радо піклується про те, 
    щоб Ви максимально комфортно і затишно провели час в нашому закладі 
    та повертались до нас ще раз і ще раз!

`,
    image: Personal
  },
  {
    title: `Mamasita Pizza – італійська піцерія для всієї родини. 
    Всім добре відомо, наскільки трепетно та з повагою італійці ставляться 
    до своєї родини. Саме тому ми створили невеличкий сімейний ресторан, 
    де кожному буде комфортно і де для кожного знайдеться улюблений смаколик!
    А ще ми любимо створювати веселу атмосферу та влаштовувати різні свята, 
    дні народження та інші приводи для радості! Приходьте до нас – завжди раді! 
    Іншими словами: Benvenuto!`
    ,
    image: Interier
  },
  {
    title: `Ми вдячні нашим клієнтам! 
    Найголовніше і важливе й цінне в нашій роботі - це наші Клієнти. 
    Для нас дуже важливо дізнатися думку про якість продукції, швидкість і сервіс. 
    Про це ми можемо знати тільки від наших Клієнтів! Наші Клієнти вчать нас 
    як стати краще, вони допомагають нам розвиватися і вдосконалюватися. 
    Ці люди платять свої гроші і вони очікують, щоб їжа була смачною, а доставка швидкою. 
    Дуже намагаємося, бо це наші Клієнти! Кожен наш Клієнт для нас це VIP персона, 
    і тому кожен замовлення для нашого Клієнта є терміновим, при найкращій якості продукції та сервіса! `,
    image: Clients
  }
]

const AboutUs = () => {
  return (
    <>
      <Container className="about">
        <h3 className="about-title">Про нас</h3>
        {aboutUsData.map((item, index) => (
          <Row key={item.title} className={`mt-5 pb-5 border-bott ${index % 2 !== 0 ? 'reverse' : ''}`}>
            <Col xs={4}>
              <Image src={item.image} className="img"/>
            </Col>
            <Col xs={8}>
              <p>
              {item.title}
              </p>
            </Col>
        </Row>
        ))}
      </Container>
    </>
  )
}

export default AboutUs;
